module.exports = [
{
   "projectID": 0,
   "projectName": "HackscrapersSF",
   "thumbURL": "/static/img/thumbs/hackscrapers_thumb.png",
   "title": "Hackscrapers SF",
   "summary": "A Python/Flask full-stack web app built during Hackbright fellowship.",
   "date": "2016",
   "problem-statement": "Hackscrapers SF encourages users to get to know the skyline of their city and explore the tall buildings around them. An API call to Flickr returns building photo urls, based on a query of photo tags, but the accuracy of existing Flickr tags, given the intent of the search, is not 100%. The quality of these tags is improved as users of the Hackscrapers app crowdsource their accuracy.",
   "solution-statement": "The app authenticates with a Flickr account and makes API calls so that users can save their favorite photos of buildings and contribute their own photos to the photos database.",
   "description": "Hackscrapers SF encourages San Francisco residents to get to know the skyline of their city and explore the tall buildings around them. Users can interact with a Mapbox GL web map that displays markers to represent tall buildings from a PostgreSQL database. An AJAX request returns a chart with more information and a Flickr photo selected at random from metadata stored in a MongoDB database. The photo results can be further queried to allow users to contribute their own search terms and filter per their interests. Users can then assemble collectible cards to display favorite buildings on their profile.",
   "future-features": "Establishing a training dataset to tag a good or bad photo, using machine learning to know which photos are of an actual building and of decent quality.",
   "partners": "solo project",
   "data": "Data come from the Skyscraper Center, a database of tall buildings maintained and updated by the Council on Tall Buildings and Urban Habitat.",
   "techstack": "Python, Flask, PostgreSQL, SQLAlchemy, MongoDB, PyMongo, Javascript, jQuery, AJAX, Jinja, Bootstrap, Chart.js, D3.js, turf.js",
   "apis": "Mapbox, Google Places, Flickr",
   "github": "https://github.com/tdiede/hackscrapers_SF",
   "deployed": "https://hackscrapers.herokuapp.com"
},{
   "projectID": 1,
   "projectName": "ADU",
   "thumbURL": "/static/img/thumbs/bentobox_thumb.png",
   "title": "ADU Toolkit",
   "summary": "A tool to customize and preview your ADU (Accessory Dwelling Unit) with a variety of architectural features.",
   "date": "2012",
   "problem-statement": "As everyone knows, the San Francisco Bay Area is in a housing crisis. According to San Francisco's Chief Economist, in order to stabilize median rents in the city, an estimated 100,000 units of housing would need to be constructed; this amount equals the number of units built since 1920.",
   "solution-statement": "Where lot size allows, the solution may be modular. Here we look to architecture for a minimum viable living condition. What sort of secondary structure can property owners consider to add capacity to their lots? This app guides users through various design and material options and their aesthetic implications.",
   "description": "",
   "future-features": "",
   "partners": "a collaborative effort with WARE in which I was the solo developer<p>ADU design, 3D model of unit, and drawings by: <a href='https://christophergparschalk.wordpress.com' target='_blank'>Chris Parschalk</a></p>",
   "techstack": "Python, Flask, PostgreSQL, SQLAlchemy, Javascript, jQuery, AJAX, Jinja, Bootstrap",
   "github": "https://github.com/tdiede/bentobox_adu",
   "deployed": "https://adubentobox.herokuapp.com/"
},{
   "projectID": 2,
   "projectName": "RatingsLab",
   "thumbURL": "/static/img/thumbs/movieratings_thumb.png",
   "title": "Movie Ratings Lab",
   "summary": "Coming soon to a screen near you...",
   "date": "2016",
   "problem-statement": "There are so many movies available to watch, so which ones will I like and which ones should I not waste my time watching? Here is an app that provides movie recommendations based on user ratings, à la Netflix.",
   "solution-statement": "Using Pearson correlation, the back end of the app correlates users with similar movie tastes as well as users with divergent movie tastes. Based on correlation and machine learning on the existing ratings, the app predicts a user's rating of a movie yet unrated.",
   "description": "Movie ratings a la Netflix.",
   "future-features": "",
   "partners": "<h4>partner: </h4><a href='https://github.com/IlsalaciousCrum' target='_blank'>Ilsa Gordon</a>",
   "data": "machine learning through Pearson correlation",
   "techstack": "Python, Flask, PostgreSQL, SQLAlchemy, JavaScript, jQuery, AJAX, Jinja, Bootstrap",
   "apis": "OMDB, https://www.omdbapi.com/",
   "github": "https://github.com/tdiede/hblab_0801-0804_ratings.git",
   "deployed": "https://movieratingsmachinelearning.herokuapp.com"
},{
   "projectID": 3,
   "projectName": "ParametricRealizations",
   "thumbURL": "/static/img/thumbs/parametric_thumb.png",
   "title": "Parametric Realizations",
   "summary": "Scripted geometries, and a set of instructions employed by CNC machine.",
   "date": "2008",
   "description": "RhinoScript is a scripting tool based on Microsoft's VBScript language. Written for the 3D modeling application Rhinoceros, my partner and I automated the generation of a variety of geometric designs. A CNC machine then took the digital instructions and drilled a series of wood plates as prototypes. Knowing some geometries would be realistically impossible, the script could be further refined.",
   "partners": "<h4>partner: </h4><a href='http://www.sinamesdaghi.com' target='_blank'>Sina Mesdaghi</a>",
   "technology": "",
   "datasets": "",
   "software": "Rhinoceros, Mastercam CAD",
   "techstack": "RhinoScript (based on Microsoft's VBScript)",
   "apis": "",
   "links": "",
   "github": "",
   "deployed": ""
},{
   "projectID": 4,
   "projectName": "VelibThesis",
   "thumbURL": "/static/img/thumbs/velib_thumb.png",
   "title": "Modal Shift to Vélib’ Bike Share: A Cognitive Mapping Approach",
   "summary": "A master's thesis using GIS analysis and mapping to study bike sharing in Paris.",
   "date": "2009",
   "description": "By probing the travel behavior and modal shifts of Vélib users, I investigated the interplay between both real and perceived effects of bike-sharing as a new transportation option in Paris. Informed by the cognitive mapping literature, the study methodology involved the gathering of route sketches from Vélib’ users’ and analyzing the resulting maps in relation to modal shifts to Vélib’, trip purpose, and trip distance estimation. In addition, I used GIS to test for spatial patterns according to levels of station use. The findings in this paper include the following: among a significant portion of Vélib’ users, the Vélib’ system serves as a substitute commuter mode from bus and metro use; longer Vélib’ trips tend to be underestimated; and a walkability measure of 200 meters to the nearest bike station appears to influence stations’ level of use. Ultimately, although the data are insufficient to be conclusive, my thesis proposes that initial system scale and density of bike stations contribute to the overall success of a bikesharing program, as measured by both ridership and modal shifts.",
   "partners": "<h4>solo academic project: master's thesis</h4>",
   "technology": "",
   "datasets": "French census, Mathieu Arnold's Vélib data pull",
   "software": "ArcMap, Spatial Statistics Toolbox, Stata, SPSS",
   "techstack": "",
   "apis": "",
   "links": "",
   "github": "",
   "deployed": ""
},{
   "projectID": 5,
   "projectName": "RowanCarto",
   "thumbURL": "/static/img/thumbs/map_thumb.png",
   "title": "West Point History of Warfare: Cartography",
   "summary": "Professional cartography produced for a digital interactive textbook.",
   "date": "2013–2014",
   "description": "The award-winning <i>West Point History of Warfare</i> offers an innovative interactive learning experience on the topic of military history. As lead cartographer I developed a process to generate 500+ maps in less than 9 months for a product used concurrently by West Point cadets. From Plato to NATO the maps and other graphic content, including data visualizations and 3D terrain fly-throughs, bring battles to life and situate conflicts in their larger political context.",
   "partners": "<h4>professional experience at ROWAN TECH</h4>",
   "technology": "",
   "datasets": "",
   "software": "ArcMap, Illustrator, Photoshop, After Effects, iBooks Author, Rhinoceros, 3dsMax",
   "techstack": "GDAL, JavaScript",
   "apis": "",
   "links": "",
   "github": "",
   "deployed": "http://www.westpointhistoryofwarfare.com/more"
},{
   "projectID": 6,
   "projectName": "GobernaStudioLibrary",
   "thumbURL": "/static/img/thumbs/cubes_thumb.png",
   "title": "Revolving Architecture: Rotating Cubes",
   "summary": "An architectural design studio: a library inspired by a work of fiction.",
   "date": "2011",
   "description": "The program of this design studio taught by Cristina Goberna was a library, which we explored through a novel of our choosing: <i>The Name of the Rose</i> by Umberto Eco. From the role the library playes in the novel, I extrapolated the theme of desire: that through never reaching an endpoint, as in a labyrinth, one continues to experience desire. Once fulfilled desire dissipates. The architectural manifestation of desire is the continual rotation of cubes: the opening and closing of new and different pop-up spaces. No experience of the library is the same as another. Each visit to the library produces a new engagement with it. In order to model the architecture to perform this function, I created a Grasshopper script to model the constraints of the rotating cubes. Through pop-up spaces, each visit is a new experience.",
   "partners": "<h4>solo design studio</h4>",
   "technology": "",
   "datasets": "Rhinoceros, Grasshopper, Illustrator",
   "software": "",
   "techstack": "",
   "apis": "",
   "links": "",
   "github": "",
   "deployed": ""
},{
   "projectID": 7,
   "projectName": "PudelmaPavilion",
   "thumbURL": "/static/img/thumbs/pavilion_thumb.png",
   "title": "Pudelma Pavilion",
   "summary": "A built pavilion where each component beam is uniquely cut according to the overall design and structural requirements.",
   "date": "2011",
   "description": "Pudelma is a pavilion in Turku, Finland. Now a landmark, the pavilion's design combined inspiration from traditional Finnish wood-working techniques and innovation made possible by computer-aided manufacturing methods. The structure stands via a basic mortise and tenon joint, where each beam either receives of abuts to four other beams creating a highly stable weave pattern. A factory-scale CNC machine cut 490 distinct Kerto-Q wood beams, ranging in length from 2-6 feet. The use of CNC fabrication resulted in extremely high tolerance, allowing the entire structure to work in compression with no glue, and minimal screws.",
   "partners": "<h4>team: </h4><a href='http://www.archdaily.com/265933/venice-biennale-2012-finnish-pavilion-presents-new-forms-in-wood/eero-lunden-markus-wikar-pudelma-in-turku-finland-04-photo-by-taavi-henttonen' target='_blank'>a collaborative effort between students from University of Oulu and Columbia University</a>",
   "technology": "",
   "datasets": "",
   "software": "Rhinoceros, Grasshopper",
   "techstack": "",
   "apis": "",
   "links": "",
   "github": "",
   "deployed": ""
},{
   "projectID": 8,
   "projectName": "PackTheBox",
   "thumbURL": "/static/img/thumbs/packthebox_thumb.gif",
   "title": "Pack the Box",
   "summary": "A Python script that packs the box with a specified shape using randomized placement, then calculates the resulting space efficiency.",
   "date": "2016",
   "problem-statement": "",
   "solution-statement": "",
   "description": "",
   "future-features": "",
   "partners": "solo project",
   "techstack": "Python, Turtle",
   "github": "https://github.com/tdiede/packthebox",
   "deployed": "n/a"
}
]
